CSI API ETABS v1
cAnalysisResultsSetup.SetComboSelectedForOutput Method
 Sets a load combination selected for output flag
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetComboSelectedForOutput(
	string Name,
	bool Selected = true
)
Function SetComboSelectedForOutput (
	Name As String,
	Optional Selected As Boolean = true
) As Integer
Dim instance As cAnalysisResultsSetup
Dim Name As String
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.SetComboSelectedForOutput(Name,
	Selected)
int SetComboSelectedForOutput(
	String^ Name,
	bool Selected = true
)
abstract SetComboSelectedForOutput :
        Name : string *
        ?Selected : bool
(* Defaults:
        let _Selected = defaultArg Selected true
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing load combination
Selected (Optional)
Type: System.Boolean
 This item is True if the specified load combination is to be selected for output, otherwise it is False
Return Value
Type: Int32
 Returns 0 if the selected flag is successfully set, otherwise it returns nonzero
Remarks
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace